## Plan Result (prod_enterprise)




<pre><code>Plan: 48 to add, 1 to change, 0 to destroy.</code></pre>

* Create
  * module.custom_role_assignments[&#34;CP-COPILOT-BETA&#34;].azurerm_role_assignment.custom_role_assignments[&#34;Application Gateway Backend Health Reader&#34;]
  * module.subscription[&#34;CP-COPILOT-BETA&#34;].azuread_application.app
  * module.subscription[&#34;CP-COPILOT-BETA&#34;].azuread_application_password.token
  * module.subscription[&#34;CP-COPILOT-BETA&#34;].azuread_group.groups[&#34;Azure Kubernetes Service Cluster Admin Role&#34;]
  * module.subscription[&#34;CP-COPILOT-BETA&#34;].azuread_group.groups[&#34;Azure Kubernetes Service Cluster User Role&#34;]
  * module.subscription[&#34;CP-COPILOT-BETA&#34;].azuread_group.groups[&#34;Contributor&#34;]
  * module.subscription[&#34;CP-COPILOT-BETA&#34;].azuread_group.groups[&#34;Key Vault Administrator&#34;]
  * module.subscription[&#34;CP-COPILOT-BETA&#34;].azuread_group.groups[&#34;Owner&#34;]
  * module.subscription[&#34;CP-COPILOT-BETA&#34;].azuread_group.groups[&#34;Reader&#34;]
  * module.subscription[&#34;CP-COPILOT-BETA&#34;].azuread_group.groups[&#34;Security Reader&#34;]
  * module.subscription[&#34;CP-COPILOT-BETA&#34;].azuread_group.groups[&#34;Storage Blob Data Reader&#34;]
  * module.subscription[&#34;CP-COPILOT-BETA&#34;].azuread_group_member.dts_operation_members
  * module.subscription[&#34;CP-COPILOT-BETA&#34;].azuread_group_member.members[&#34;Azure Kubernetes Service Cluster Admin Role-0&#34;]
  * module.subscription[&#34;CP-COPILOT-BETA&#34;].azuread_group_member.members[&#34;Contributor-0&#34;]
  * module.subscription[&#34;CP-COPILOT-BETA&#34;].azuread_group_member.members[&#34;Contributor-1&#34;]
  * module.subscription[&#34;CP-COPILOT-BETA&#34;].azuread_group_member.members[&#34;Contributor-2&#34;]
  * module.subscription[&#34;CP-COPILOT-BETA&#34;].azuread_group_member.members[&#34;Key Vault Administrator-0&#34;]
  * module.subscription[&#34;CP-COPILOT-BETA&#34;].azuread_group_member.members[&#34;Key Vault Administrator-1&#34;]
  * module.subscription[&#34;CP-COPILOT-BETA&#34;].azuread_group_member.members[&#34;Owner-0&#34;]
  * module.subscription[&#34;CP-COPILOT-BETA&#34;].azuread_group_member.members[&#34;Reader-0&#34;]
  * module.subscription[&#34;CP-COPILOT-BETA&#34;].azuread_service_principal.sp
  * module.subscription[&#34;CP-COPILOT-BETA&#34;].azuredevops_serviceendpoint_azurerm.endpoint
  * module.subscription[&#34;CP-COPILOT-BETA&#34;].azurerm_key_vault.kv
  * module.subscription[&#34;CP-COPILOT-BETA&#34;].azurerm_key_vault_access_policy.permissions
  * module.subscription[&#34;CP-COPILOT-BETA&#34;].azurerm_key_vault_secret.aks_admin_group_id
  * module.subscription[&#34;CP-COPILOT-BETA&#34;].azurerm_key_vault_secret.aks_user_group_id
  * module.subscription[&#34;CP-COPILOT-BETA&#34;].azurerm_key_vault_secret.sp_app_id
  * module.subscription[&#34;CP-COPILOT-BETA&#34;].azurerm_key_vault_secret.sp_object_id
  * module.subscription[&#34;CP-COPILOT-BETA&#34;].azurerm_key_vault_secret.sp_token
  * module.subscription[&#34;CP-COPILOT-BETA&#34;].azurerm_role_assignment.local_groups[&#34;Azure Kubernetes Service Cluster Admin Role&#34;]
  * module.subscription[&#34;CP-COPILOT-BETA&#34;].azurerm_role_assignment.local_groups[&#34;Azure Kubernetes Service Cluster User Role&#34;]
  * module.subscription[&#34;CP-COPILOT-BETA&#34;].azurerm_role_assignment.local_groups[&#34;Contributor&#34;]
  * module.subscription[&#34;CP-COPILOT-BETA&#34;].azurerm_role_assignment.local_groups[&#34;Key Vault Administrator&#34;]
  * module.subscription[&#34;CP-COPILOT-BETA&#34;].azurerm_role_assignment.local_groups[&#34;Owner&#34;]
  * module.subscription[&#34;CP-COPILOT-BETA&#34;].azurerm_role_assignment.local_groups[&#34;Reader&#34;]
  * module.subscription[&#34;CP-COPILOT-BETA&#34;].azurerm_role_assignment.local_groups[&#34;Security Reader&#34;]
  * module.subscription[&#34;CP-COPILOT-BETA&#34;].azurerm_role_assignment.local_groups[&#34;Storage Blob Data Reader&#34;]
  * module.subscription[&#34;CP-COPILOT-BETA&#34;].azurerm_role_assignment.local_role_assignments[&#34;Key Vault Contributor&#34;]
  * module.subscription[&#34;CP-COPILOT-BETA&#34;].azurerm_role_assignment.local_role_assignments[&#34;Monitoring Contributor&#34;]
  * module.subscription[&#34;CP-COPILOT-BETA&#34;].azurerm_role_assignment.local_role_assignments[&#34;Network Contributor&#34;]
  * module.subscription[&#34;CP-COPILOT-BETA&#34;].azurerm_role_assignment.local_role_assignments[&#34;Storage Account Contributor&#34;]
  * module.subscription[&#34;CP-COPILOT-BETA&#34;].azurerm_role_assignment.local_role_assignments[&#34;Storage Blob Data Contributor&#34;]
  * module.subscription[&#34;CP-COPILOT-BETA&#34;].azurerm_role_assignment.local_role_assignments[&#34;User Access Administrator&#34;]
  * module.subscription[&#34;CP-COPILOT-BETA&#34;].azurerm_storage_account.sa
  * module.subscription[&#34;CP-COPILOT-BETA&#34;].azurerm_storage_container.sc
  * module.subscription[&#34;CP-COPILOT-BETA&#34;].azurerm_subscription.this
  * module.subscription[&#34;CP-COPILOT-BETA&#34;].random_uuid.app_uuid
  * module.subscription[&#34;CP-COPILOT-BETA&#34;].time_rotating.rotation_period
* Update
  * module.enterprise.azurerm_management_group.level_3[&#34;Platform-Sandbox&#34;]




<details><summary>Change Result (Click me)</summary>

```hcl

  # module.custom_role_assignments["CP-COPILOT-BETA"].azurerm_role_assignment.custom_role_assignments["Application Gateway Backend Health Reader"] will be created
  + resource "azurerm_role_assignment" "custom_role_assignments" {
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = (known after apply)
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = (known after apply)
      + scope                            = (known after apply)
      + skip_service_principal_aad_check = (known after apply)
    }

  # module.enterprise.azurerm_management_group.level_3["Platform-Sandbox"] will be updated in-place
  ~ resource "azurerm_management_group" "level_3" {
        id                         = "/providers/Microsoft.Management/managementGroups/Platform-Sandbox"
        name                       = "Platform-Sandbox"
      ~ subscription_ids           = [
          - "1fe7db01-9981-4ed3-983c-163dd50ba43a",
          - "5709598c-3a1c-4535-8979-f10948b9a031",
          - "681c247c-c695-4b87-b018-8756a0b8b19d",
          - "b3394340-6c9f-44ca-aa3e-9ff38bd1f9ac",
          - "ea3a8c1e-af9d-4108-bc86-a7e2d267f49c",
        ] -> (known after apply)
        # (2 unchanged attributes hidden)
    }

  # module.subscription["CP-COPILOT-BETA"].azuread_application.app will be created
  + resource "azuread_application" "app" {
      + app_role_ids                = (known after apply)
      + application_id              = (known after apply)
      + client_id                   = (known after apply)
      + disabled_by_microsoft       = (known after apply)
      + display_name                = "DTS Bootstrap (sub:cp-copilot-beta)"
      + id                          = (known after apply)
      + logo_url                    = (known after apply)
      + notes                       = "This service principal created by hmcts/azure-enterprise repository"
      + oauth2_permission_scope_ids = (known after apply)
      + object_id                   = (known after apply)
      + prevent_duplicate_names     = false
      + publisher_domain            = (known after apply)
      + sign_in_audience            = "AzureADMyOrg"
      + tags                        = (known after apply)
      + template_id                 = (known after apply)

      + api {
          + requested_access_token_version = 1

          + oauth2_permission_scope {
              + admin_consent_description  = "Allow the application to access DTS Bootstrap (sub:cp-copilot-beta) on behalf of the signed-in user."
              + admin_consent_display_name = "Access DTS Bootstrap (sub:cp-copilot-beta)"
              + enabled                    = true
              + id                         = (known after apply)
              + type                       = "User"
              + user_consent_description   = "Allow the application to access DTS Bootstrap (sub:cp-copilot-beta) on your behalf."
              + user_consent_display_name  = "Access DTS Bootstrap (sub:cp-copilot-beta)"
              + value                      = "user_impersonation"
            }
        }

      + required_resource_access {
          + resource_app_id = "00000003-0000-0000-c000-000000000000"

          + resource_access {
              + id   = "06da0dbc-49e2-44d2-8312-53f166ab848a"
              + type = "Scope"
            }
          + resource_access {
              + id   = "5b567255-7703-4780-807c-7be8301ae99b"
              + type = "Role"
            }
          + resource_access {
              + id   = "9a5d68dd-52b0-4cc2-bd40-abcf44ac3a30"
              + type = "Role"
            }
        }

      + web {
          + homepage_url = "https://dev.azure.com/hmcts/PlatformOperations"

          + implicit_grant {
              + access_token_issuance_enabled = false
              + id_token_issuance_enabled     = true
            }
        }
    }

  # module.subscription["CP-COPILOT-BETA"].azuread_application_password.token will be created
  + resource "azuread_application_password" "token" {
      + application_id        = (known after apply)
      + application_object_id = (known after apply)
      + display_name          = (known after apply)
      + end_date              = (known after apply)
      + id                    = (known after apply)
      + key_id                = (known after apply)
      + rotate_when_changed   = (known after apply)
      + start_date            = (known after apply)
      + value                 = (sensitive value)
    }

  # module.subscription["CP-COPILOT-BETA"].azuread_group.groups["Azure Kubernetes Service Cluster Admin Role"] will be created
  + resource "azuread_group" "groups" {
      + auto_subscribe_new_members     = (known after apply)
      + description                    = "Grants aks cluster admin permissions to the CP-COPILOT-BETA subscription"
      + display_name                   = "DTS AKS Administrators (sub:cp-copilot-beta)"
      + external_senders_allowed       = (known after apply)
      + hide_from_address_lists        = (known after apply)
      + hide_from_outlook_clients      = (known after apply)
      + id                             = (known after apply)
      + mail                           = (known after apply)
      + mail_nickname                  = (known after apply)
      + members                        = (known after apply)
      + object_id                      = (known after apply)
      + onpremises_domain_name         = (known after apply)
      + onpremises_group_type          = (known after apply)
      + onpremises_netbios_name        = (known after apply)
      + onpremises_sam_account_name    = (known after apply)
      + onpremises_security_identifier = (known after apply)
      + onpremises_sync_enabled        = (known after apply)
      + owners                         = (known after apply)
      + preferred_language             = (known after apply)
      + prevent_duplicate_names        = true
      + proxy_addresses                = (known after apply)
      + security_enabled               = true
      + visibility                     = (known after apply)
      + writeback_enabled              = false
    }

  # module.subscription["CP-COPILOT-BETA"].azuread_group.groups["Azure Kubernetes Service Cluster User Role"] will be created
  + resource "azuread_group" "groups" {
      + auto_subscribe_new_members     = (known after apply)
      + description                    = "Grants aks cluster user permissions to the CP-COPILOT-BETA subscription"
      + display_name                   = "DTS AKS Users (sub:cp-copilot-beta)"
      + external_senders_allowed       = (known after apply)
      + hide_from_address_lists        = (known after apply)
      + hide_from_outlook_clients      = (known after apply)
      + id                             = (known after apply)
      + mail                           = (known after apply)
      + mail_nickname                  = (known after apply)
      + members                        = (known after apply)
      + object_id                      = (known after apply)
      + onpremises_domain_name         = (known after apply)
      + onpremises_group_type          = (known after apply)
      + onpremises_netbios_name        = (known after apply)
      + onpremises_sam_account_name    = (known after apply)
      + onpremises_security_identifier = (known after apply)
      + onpremises_sync_enabled        = (known after apply)
      + owners                         = (known after apply)
      + preferred_language             = (known after apply)
      + prevent_duplicate_names        = true
      + proxy_addresses                = (known after apply)
      + security_enabled               = true
      + visibility                     = (known after apply)
      + writeback_enabled              = false
    }

  # module.subscription["CP-COPILOT-BETA"].azuread_group.groups["Contributor"] will be created
  + resource "azuread_group" "groups" {
      + auto_subscribe_new_members     = (known after apply)
      + description                    = "Grants contributor permissions to the CP-COPILOT-BETA subscription"
      + display_name                   = "DTS Contributors (sub:cp-copilot-beta)"
      + external_senders_allowed       = (known after apply)
      + hide_from_address_lists        = (known after apply)
      + hide_from_outlook_clients      = (known after apply)
      + id                             = (known after apply)
      + mail                           = (known after apply)
      + mail_nickname                  = (known after apply)
      + members                        = (known after apply)
      + object_id                      = (known after apply)
      + onpremises_domain_name         = (known after apply)
      + onpremises_group_type          = (known after apply)
      + onpremises_netbios_name        = (known after apply)
      + onpremises_sam_account_name    = (known after apply)
      + onpremises_security_identifier = (known after apply)
      + onpremises_sync_enabled        = (known after apply)
      + owners                         = (known after apply)
      + preferred_language             = (known after apply)
      + prevent_duplicate_names        = true
      + proxy_addresses                = (known after apply)
      + security_enabled               = true
      + visibility                     = (known after apply)
      + writeback_enabled              = false
    }

  # module.subscription["CP-COPILOT-BETA"].azuread_group.groups["Key Vault Administrator"] will be created
  + resource "azuread_group" "groups" {
      + auto_subscribe_new_members     = (known after apply)
      + description                    = "Grants key vault administrator permissions to the CP-COPILOT-BETA subscription"
      + display_name                   = "DTS Key Vault Administrators (sub:cp-copilot-beta)"
      + external_senders_allowed       = (known after apply)
      + hide_from_address_lists        = (known after apply)
      + hide_from_outlook_clients      = (known after apply)
      + id                             = (known after apply)
      + mail                           = (known after apply)
      + mail_nickname                  = (known after apply)
      + members                        = (known after apply)
      + object_id                      = (known after apply)
      + onpremises_domain_name         = (known after apply)
      + onpremises_group_type          = (known after apply)
      + onpremises_netbios_name        = (known after apply)
      + onpremises_sam_account_name    = (known after apply)
      + onpremises_security_identifier = (known after apply)
      + onpremises_sync_enabled        = (known after apply)
      + owners                         = (known after apply)
      + preferred_language             = (known after apply)
      + prevent_duplicate_names        = true
      + proxy_addresses                = (known after apply)
      + security_enabled               = true
      + visibility                     = (known after apply)
      + writeback_enabled              = false
    }

  # module.subscription["CP-COPILOT-BETA"].azuread_group.groups["Owner"] will be created
  + resource "azuread_group" "groups" {
      + auto_subscribe_new_members     = (known after apply)
      + description                    = "Grants owner permissions to the CP-COPILOT-BETA subscription"
      + display_name                   = "DTS Owners (sub:cp-copilot-beta)"
      + external_senders_allowed       = (known after apply)
      + hide_from_address_lists        = (known after apply)
      + hide_from_outlook_clients      = (known after apply)
      + id                             = (known after apply)
      + mail                           = (known after apply)
      + mail_nickname                  = (known after apply)
      + members                        = (known after apply)
      + object_id                      = (known after apply)
      + onpremises_domain_name         = (known after apply)
      + onpremises_group_type          = (known after apply)
      + onpremises_netbios_name        = (known after apply)
      + onpremises_sam_account_name    = (known after apply)
      + onpremises_security_identifier = (known after apply)
      + onpremises_sync_enabled        = (known after apply)
      + owners                         = (known after apply)
      + preferred_language             = (known after apply)
      + prevent_duplicate_names        = true
      + proxy_addresses                = (known after apply)
      + security_enabled               = true
      + visibility                     = (known after apply)
      + writeback_enabled              = false
    }

  # module.subscription["CP-COPILOT-BETA"].azuread_group.groups["Reader"] will be created
  + resource "azuread_group" "groups" {
      + auto_subscribe_new_members     = (known after apply)
      + description                    = "Grants reader permissions to the CP-COPILOT-BETA subscription"
      + display_name                   = "DTS Readers (sub:cp-copilot-beta)"
      + external_senders_allowed       = (known after apply)
      + hide_from_address_lists        = (known after apply)
      + hide_from_outlook_clients      = (known after apply)
      + id                             = (known after apply)
      + mail                           = (known after apply)
      + mail_nickname                  = (known after apply)
      + members                        = (known after apply)
      + object_id                      = (known after apply)
      + onpremises_domain_name         = (known after apply)
      + onpremises_group_type          = (known after apply)
      + onpremises_netbios_name        = (known after apply)
      + onpremises_sam_account_name    = (known after apply)
      + onpremises_security_identifier = (known after apply)
      + onpremises_sync_enabled        = (known after apply)
      + owners                         = (known after apply)
      + preferred_language             = (known after apply)
      + prevent_duplicate_names        = true
      + proxy_addresses                = (known after apply)
      + security_enabled               = true
      + visibility                     = (known after apply)
      + writeback_enabled              = false
    }

  # module.subscription["CP-COPILOT-BETA"].azuread_group.groups["Security Reader"] will be created
  + resource "azuread_group" "groups" {
      + auto_subscribe_new_members     = (known after apply)
      + description                    = "Grants security reader permissions to the CP-COPILOT-BETA subscription"
      + display_name                   = "DTS Security Readers (sub:cp-copilot-beta)"
      + external_senders_allowed       = (known after apply)
      + hide_from_address_lists        = (known after apply)
      + hide_from_outlook_clients      = (known after apply)
      + id                             = (known after apply)
      + mail                           = (known after apply)
      + mail_nickname                  = (known after apply)
      + members                        = (known after apply)
      + object_id                      = (known after apply)
      + onpremises_domain_name         = (known after apply)
      + onpremises_group_type          = (known after apply)
      + onpremises_netbios_name        = (known after apply)
      + onpremises_sam_account_name    = (known after apply)
      + onpremises_security_identifier = (known after apply)
      + onpremises_sync_enabled        = (known after apply)
      + owners                         = (known after apply)
      + preferred_language             = (known after apply)
      + prevent_duplicate_names        = true
      + proxy_addresses                = (known after apply)
      + security_enabled               = true
      + visibility                     = (known after apply)
      + writeback_enabled              = false
    }

  # module.subscription["CP-COPILOT-BETA"].azuread_group.groups["Storage Blob Data Reader"] will be created
  + resource "azuread_group" "groups" {
      + auto_subscribe_new_members     = (known after apply)
      + description                    = "Grants storage blob data contributor permissions to the CP-COPILOT-BETA subscription"
      + display_name                   = "DTS Blob Readers (sub:cp-copilot-beta)"
      + external_senders_allowed       = (known after apply)
      + hide_from_address_lists        = (known after apply)
      + hide_from_outlook_clients      = (known after apply)
      + id                             = (known after apply)
      + mail                           = (known after apply)
      + mail_nickname                  = (known after apply)
      + members                        = (known after apply)
      + object_id                      = (known after apply)
      + onpremises_domain_name         = (known after apply)
      + onpremises_group_type          = (known after apply)
      + onpremises_netbios_name        = (known after apply)
      + onpremises_sam_account_name    = (known after apply)
      + onpremises_security_identifier = (known after apply)
      + onpremises_sync_enabled        = (known after apply)
      + owners                         = (known after apply)
      + preferred_language             = (known after apply)
      + prevent_duplicate_names        = true
      + proxy_addresses                = (known after apply)
      + security_enabled               = true
      + visibility                     = (known after apply)
      + writeback_enabled              = false
    }

  # module.subscription["CP-COPILOT-BETA"].azuread_group_member.dts_operation_members will be created
  + resource "azuread_group_member" "dts_operation_members" {
      + group_object_id  = "af66f4e5-bd36-4ad9-a265-d9e7c947cbab"
      + id               = (known after apply)
      + member_object_id = (known after apply)
    }

  # module.subscription["CP-COPILOT-BETA"].azuread_group_member.members["Azure Kubernetes Service Cluster Admin Role-0"] will be created
  + resource "azuread_group_member" "members" {
      + group_object_id  = (known after apply)
      + id               = (known after apply)
      + member_object_id = "a6ce5b32-e0a5-419e-ba5c-67863c975941"
    }

  # module.subscription["CP-COPILOT-BETA"].azuread_group_member.members["Contributor-0"] will be created
  + resource "azuread_group_member" "members" {
      + group_object_id  = (known after apply)
      + id               = (known after apply)
      + member_object_id = "af66f4e5-bd36-4ad9-a265-d9e7c947cbab"
    }

  # module.subscription["CP-COPILOT-BETA"].azuread_group_member.members["Contributor-1"] will be created
  + resource "azuread_group_member" "members" {
      + group_object_id  = (known after apply)
      + id               = (known after apply)
      + member_object_id = (known after apply)
    }

  # module.subscription["CP-COPILOT-BETA"].azuread_group_member.members["Contributor-2"] will be created
  + resource "azuread_group_member" "members" {
      + group_object_id  = (known after apply)
      + id               = (known after apply)
      + member_object_id = "0ec60e03-4262-44ce-abcf-83e2131c9207"
    }

  # module.subscription["CP-COPILOT-BETA"].azuread_group_member.members["Key Vault Administrator-0"] will be created
  + resource "azuread_group_member" "members" {
      + group_object_id  = (known after apply)
      + id               = (known after apply)
      + member_object_id = "af66f4e5-bd36-4ad9-a265-d9e7c947cbab"
    }

  # module.subscription["CP-COPILOT-BETA"].azuread_group_member.members["Key Vault Administrator-1"] will be created
  + resource "azuread_group_member" "members" {
      + group_object_id  = (known after apply)
      + id               = (known after apply)
      + member_object_id = (known after apply)
    }

  # module.subscription["CP-COPILOT-BETA"].azuread_group_member.members["Owner-0"] will be created
  + resource "azuread_group_member" "members" {
      + group_object_id  = (known after apply)
      + id               = (known after apply)
      + member_object_id = (known after apply)
    }

  # module.subscription["CP-COPILOT-BETA"].azuread_group_member.members["Reader-0"] will be created
  + resource "azuread_group_member" "members" {
      + group_object_id  = (known after apply)
      + id               = (known after apply)
      + member_object_id = "e6c7b379-03ba-483d-ae1d-f3cab6579a6f"
    }

  # module.subscription["CP-COPILOT-BETA"].azuread_service_principal.sp will be created
  + resource "azuread_service_principal" "sp" {
      + account_enabled             = true
      + app_role_ids                = (known after apply)
      + app_roles                   = (known after apply)
      + application_id              = (known after apply)
      + application_tenant_id       = (known after apply)
      + client_id                   = (known after apply)
      + display_name                = (known after apply)
      + homepage_url                = (known after apply)
      + id                          = (known after apply)
      + logout_url                  = (known after apply)
      + oauth2_permission_scope_ids = (known after apply)
      + oauth2_permission_scopes    = (known after apply)
      + object_id                   = (known after apply)
      + redirect_uris               = (known after apply)
      + saml_metadata_url           = (known after apply)
      + service_principal_names     = (known after apply)
      + sign_in_audience            = (known after apply)
      + tags                        = (known after apply)
      + type                        = (known after apply)
    }

  # module.subscription["CP-COPILOT-BETA"].azuredevops_serviceendpoint_azurerm.endpoint will be created
  + resource "azuredevops_serviceendpoint_azurerm" "endpoint" {
      + authorization                          = (known after apply)
      + azurerm_spn_tenantid                   = "531ff96d-0ae9-462a-8d2d-bec7c0b42082"
      + azurerm_subscription_id                = (known after apply)
      + azurerm_subscription_name              = "CP-COPILOT-BETA"
      + description                            = "Managed by Terraform"
      + environment                            = "AzureCloud"
      + id                                     = (known after apply)
      + project_id                             = "c8947a39-47e3-4236-8bc8-51ff42dbda51"
      + service_endpoint_authentication_scheme = "ServicePrincipal"
      + service_endpoint_name                  = "CP-COPILOT-BETA"
      + service_principal_id                   = (known after apply)
      + workload_identity_federation_issuer    = (known after apply)
      + workload_identity_federation_subject   = (known after apply)

      + credentials {
          + serviceprincipalid  = (known after apply)
          + serviceprincipalkey = (sensitive value)
        }
    }

  # module.subscription["CP-COPILOT-BETA"].azurerm_key_vault.kv will be created
  + resource "azurerm_key_vault" "kv" {
      + access_policy                 = (known after apply)
      + id                            = (known after apply)
      + location                      = "uksouth"
      + name                          = (known after apply)
      + public_network_access_enabled = true
      + purge_protection_enabled      = false
      + resource_group_name           = "azure-control-sbox-rg"
      + sku_name                      = "standard"
      + soft_delete_retention_days    = 90
      + tags                          = {
          + "application"  = "core"
          + "builtFrom"    = "hmcts/azure-enterprise"
          + "businessArea" = "Cross-Cutting"
          + "criticality"  = "Low"
          + "environment"  = "sandbox"
          + "expiresAfter" = "3000-01-01"
          + "startupMode"  = "always"
        }
      + tenant_id                     = "531ff96d-0ae9-462a-8d2d-bec7c0b42082"
      + vault_uri                     = (known after apply)
    }

  # module.subscription["CP-COPILOT-BETA"].azurerm_key_vault_access_policy.permissions will be created
  + resource "azurerm_key_vault_access_policy" "permissions" {
      + certificate_permissions = [
          + "Backup",
          + "Create",
          + "Delete",
          + "DeleteIssuers",
          + "Get",
          + "GetIssuers",
          + "Import",
          + "List",
          + "ListIssuers",
          + "ManageContacts",
          + "ManageIssuers",
          + "Recover",
          + "Restore",
          + "SetIssuers",
          + "Update",
        ]
      + id                      = (known after apply)
      + key_permissions         = [
          + "Backup",
          + "Create",
          + "Decrypt",
          + "Delete",
          + "Encrypt",
          + "Get",
          + "Import",
          + "List",
          + "Recover",
          + "Restore",
          + "Sign",
          + "UnwrapKey",
          + "Update",
          + "Verify",
          + "WrapKey",
        ]
      + key_vault_id            = (known after apply)
      + object_id               = (known after apply)
      + secret_permissions      = [
          + "Get",
          + "Set",
          + "List",
          + "Delete",
          + "Restore",
          + "Recover",
          + "Backup",
        ]
      + storage_permissions     = [
          + "Backup",
          + "Delete",
          + "DeleteSAS",
          + "Get",
          + "GetSAS",
          + "List",
          + "ListSAS",
          + "Recover",
          + "RegenerateKey",
          + "Restore",
          + "Set",
          + "SetSAS",
          + "Update",
        ]
      + tenant_id               = "531ff96d-0ae9-462a-8d2d-bec7c0b42082"
    }

  # module.subscription["CP-COPILOT-BETA"].azurerm_key_vault_secret.aks_admin_group_id will be created
  + resource "azurerm_key_vault_secret" "aks_admin_group_id" {
      + id                      = (known after apply)
      + key_vault_id            = (known after apply)
      + name                    = "aks-admin-rbac-group-id"
      + resource_id             = (known after apply)
      + resource_versionless_id = (known after apply)
      + value                   = (sensitive value)
      + version                 = (known after apply)
      + versionless_id          = (known after apply)
    }

  # module.subscription["CP-COPILOT-BETA"].azurerm_key_vault_secret.aks_user_group_id will be created
  + resource "azurerm_key_vault_secret" "aks_user_group_id" {
      + id                      = (known after apply)
      + key_vault_id            = (known after apply)
      + name                    = "aks-user-rbac-group-id"
      + resource_id             = (known after apply)
      + resource_versionless_id = (known after apply)
      + value                   = (sensitive value)
      + version                 = (known after apply)
      + versionless_id          = (known after apply)
    }

  # module.subscription["CP-COPILOT-BETA"].azurerm_key_vault_secret.sp_app_id will be created
  + resource "azurerm_key_vault_secret" "sp_app_id" {
      + id                      = (known after apply)
      + key_vault_id            = (known after apply)
      + name                    = "sp-application-id"
      + resource_id             = (known after apply)
      + resource_versionless_id = (known after apply)
      + value                   = (sensitive value)
      + version                 = (known after apply)
      + versionless_id          = (known after apply)
    }

  # module.subscription["CP-COPILOT-BETA"].azurerm_key_vault_secret.sp_object_id will be created
  + resource "azurerm_key_vault_secret" "sp_object_id" {
      + id                      = (known after apply)
      + key_vault_id            = (known after apply)
      + name                    = "sp-object-id"
      + resource_id             = (known after apply)
      + resource_versionless_id = (known after apply)
      + value                   = (sensitive value)
      + version                 = (known after apply)
      + versionless_id          = (known after apply)
    }

  # module.subscription["CP-COPILOT-BETA"].azurerm_key_vault_secret.sp_token will be created
  + resource "azurerm_key_vault_secret" "sp_token" {
      + id                      = (known after apply)
      + key_vault_id            = (known after apply)
      + name                    = "sp-token"
      + resource_id             = (known after apply)
      + resource_versionless_id = (known after apply)
      + value                   = (sensitive value)
      + version                 = (known after apply)
      + versionless_id          = (known after apply)
    }

  # module.subscription["CP-COPILOT-BETA"].azurerm_role_assignment.local_groups["Azure Kubernetes Service Cluster Admin Role"] will be created
  + resource "azurerm_role_assignment" "local_groups" {
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = (known after apply)
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Azure Kubernetes Service Cluster Admin Role"
      + scope                            = (known after apply)
      + skip_service_principal_aad_check = (known after apply)
    }

  # module.subscription["CP-COPILOT-BETA"].azurerm_role_assignment.local_groups["Azure Kubernetes Service Cluster User Role"] will be created
  + resource "azurerm_role_assignment" "local_groups" {
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = (known after apply)
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Azure Kubernetes Service Cluster User Role"
      + scope                            = (known after apply)
      + skip_service_principal_aad_check = (known after apply)
    }

  # module.subscription["CP-COPILOT-BETA"].azurerm_role_assignment.local_groups["Contributor"] will be created
  + resource "azurerm_role_assignment" "local_groups" {
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = (known after apply)
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Contributor"
      + scope                            = (known after apply)
      + skip_service_principal_aad_check = (known after apply)
    }

  # module.subscription["CP-COPILOT-BETA"].azurerm_role_assignment.local_groups["Key Vault Administrator"] will be created
  + resource "azurerm_role_assignment" "local_groups" {
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = (known after apply)
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Key Vault Administrator"
      + scope                            = (known after apply)
      + skip_service_principal_aad_check = (known after apply)
    }

  # module.subscription["CP-COPILOT-BETA"].azurerm_role_assignment.local_groups["Owner"] will be created
  + resource "azurerm_role_assignment" "local_groups" {
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = (known after apply)
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Owner"
      + scope                            = (known after apply)
      + skip_service_principal_aad_check = (known after apply)
    }

  # module.subscription["CP-COPILOT-BETA"].azurerm_role_assignment.local_groups["Reader"] will be created
  + resource "azurerm_role_assignment" "local_groups" {
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = (known after apply)
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Reader"
      + scope                            = (known after apply)
      + skip_service_principal_aad_check = (known after apply)
    }

  # module.subscription["CP-COPILOT-BETA"].azurerm_role_assignment.local_groups["Security Reader"] will be created
  + resource "azurerm_role_assignment" "local_groups" {
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = (known after apply)
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Security Reader"
      + scope                            = (known after apply)
      + skip_service_principal_aad_check = (known after apply)
    }

  # module.subscription["CP-COPILOT-BETA"].azurerm_role_assignment.local_groups["Storage Blob Data Reader"] will be created
  + resource "azurerm_role_assignment" "local_groups" {
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = (known after apply)
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Storage Blob Data Reader"
      + scope                            = (known after apply)
      + skip_service_principal_aad_check = (known after apply)
    }

  # module.subscription["CP-COPILOT-BETA"].azurerm_role_assignment.local_role_assignments["Key Vault Contributor"] will be created
  + resource "azurerm_role_assignment" "local_role_assignments" {
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = (known after apply)
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Key Vault Contributor"
      + scope                            = (known after apply)
      + skip_service_principal_aad_check = (known after apply)
    }

  # module.subscription["CP-COPILOT-BETA"].azurerm_role_assignment.local_role_assignments["Monitoring Contributor"] will be created
  + resource "azurerm_role_assignment" "local_role_assignments" {
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = "e6c7b379-03ba-483d-ae1d-f3cab6579a6f"
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Monitoring Contributor"
      + scope                            = (known after apply)
      + skip_service_principal_aad_check = (known after apply)
    }

  # module.subscription["CP-COPILOT-BETA"].azurerm_role_assignment.local_role_assignments["Network Contributor"] will be created
  + resource "azurerm_role_assignment" "local_role_assignments" {
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = "e6c7b379-03ba-483d-ae1d-f3cab6579a6f"
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Network Contributor"
      + scope                            = (known after apply)
      + skip_service_principal_aad_check = (known after apply)
    }

  # module.subscription["CP-COPILOT-BETA"].azurerm_role_assignment.local_role_assignments["Storage Account Contributor"] will be created
  + resource "azurerm_role_assignment" "local_role_assignments" {
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = (known after apply)
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Storage Account Contributor"
      + scope                            = (known after apply)
      + skip_service_principal_aad_check = (known after apply)
    }

  # module.subscription["CP-COPILOT-BETA"].azurerm_role_assignment.local_role_assignments["Storage Blob Data Contributor"] will be created
  + resource "azurerm_role_assignment" "local_role_assignments" {
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = (known after apply)
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Storage Blob Data Contributor"
      + scope                            = (known after apply)
      + skip_service_principal_aad_check = (known after apply)
    }

  # module.subscription["CP-COPILOT-BETA"].azurerm_role_assignment.local_role_assignments["User Access Administrator"] will be created
  + resource "azurerm_role_assignment" "local_role_assignments" {
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = "af66f4e5-bd36-4ad9-a265-d9e7c947cbab"
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "User Access Administrator"
      + scope                            = (known after apply)
      + skip_service_principal_aad_check = (known after apply)
    }

  # module.subscription["CP-COPILOT-BETA"].azurerm_storage_account.sa will be created
  + resource "azurerm_storage_account" "sa" {
      + access_tier                       = (known after apply)
      + account_kind                      = "StorageV2"
      + account_replication_type          = "ZRS"
      + account_tier                      = "Standard"
      + allow_nested_items_to_be_public   = false
      + cross_tenant_replication_enabled  = true
      + default_to_oauth_authentication   = false
      + enable_https_traffic_only         = true
      + id                                = (known after apply)
      + infrastructure_encryption_enabled = false
      + is_hns_enabled                    = false
      + large_file_share_enabled          = (known after apply)
      + location                          = "uksouth"
      + min_tls_version                   = "TLS1_2"
      + name                              = (known after apply)
      + nfsv3_enabled                     = false
      + primary_access_key                = (sensitive value)
      + primary_blob_connection_string    = (sensitive value)
      + primary_blob_endpoint             = (known after apply)
      + primary_blob_host                 = (known after apply)
      + primary_connection_string         = (sensitive value)
      + primary_dfs_endpoint              = (known after apply)
      + primary_dfs_host                  = (known after apply)
      + primary_file_endpoint             = (known after apply)
      + primary_file_host                 = (known after apply)
      + primary_location                  = (known after apply)
      + primary_queue_endpoint            = (known after apply)
      + primary_queue_host                = (known after apply)
      + primary_table_endpoint            = (known after apply)
      + primary_table_host                = (known after apply)
      + primary_web_endpoint              = (known after apply)
      + primary_web_host                  = (known after apply)
      + public_network_access_enabled     = true
      + queue_encryption_key_type         = "Service"
      + resource_group_name               = "azure-control-sbox-rg"
      + secondary_access_key              = (sensitive value)
      + secondary_blob_connection_string  = (sensitive value)
      + secondary_blob_endpoint           = (known after apply)
      + secondary_blob_host               = (known after apply)
      + secondary_connection_string       = (sensitive value)
      + secondary_dfs_endpoint            = (known after apply)
      + secondary_dfs_host                = (known after apply)
      + secondary_file_endpoint           = (known after apply)
      + secondary_file_host               = (known after apply)
      + secondary_location                = (known after apply)
      + secondary_queue_endpoint          = (known after apply)
      + secondary_queue_host              = (known after apply)
      + secondary_table_endpoint          = (known after apply)
      + secondary_table_host              = (known after apply)
      + secondary_web_endpoint            = (known after apply)
      + secondary_web_host                = (known after apply)
      + sftp_enabled                      = false
      + shared_access_key_enabled         = true
      + table_encryption_key_type         = "Service"
      + tags                              = {
          + "application"  = "core"
          + "builtFrom"    = "hmcts/azure-enterprise"
          + "businessArea" = "Cross-Cutting"
          + "criticality"  = "Low"
          + "environment"  = "sandbox"
          + "expiresAfter" = "3000-01-01"
          + "startupMode"  = "always"
        }

      + blob_properties {
          + change_feed_enabled      = false
          + default_service_version  = (known after apply)
          + last_access_time_enabled = false
          + versioning_enabled       = true

          + delete_retention_policy {
              + days = 30
            }
        }
    }

  # module.subscription["CP-COPILOT-BETA"].azurerm_storage_container.sc will be created
  + resource "azurerm_storage_container" "sc" {
      + container_access_type   = "private"
      + has_immutability_policy = (known after apply)
      + has_legal_hold          = (known after apply)
      + id                      = (known after apply)
      + metadata                = (known after apply)
      + name                    = "subscription-tfstate"
      + resource_manager_id     = (known after apply)
      + storage_account_name    = (known after apply)
    }

  # module.subscription["CP-COPILOT-BETA"].azurerm_subscription.this will be created
  + resource "azurerm_subscription" "this" {
      + alias             = "CP-COPILOT-BETA"
      + billing_scope_id  = "/providers/Microsoft.Billing/billingAccounts/59232335/enrollmentAccounts/233705"
      + id                = (known after apply)
      + subscription_id   = (known after apply)
      + subscription_name = "CP-COPILOT-BETA"
      + tenant_id         = (known after apply)
    }

  # module.subscription["CP-COPILOT-BETA"].random_uuid.app_uuid will be created
  + resource "random_uuid" "app_uuid" {
      + id     = (known after apply)
      + result = (known after apply)
    }

  # module.subscription["CP-COPILOT-BETA"].time_rotating.rotation_period will be created
  + resource "time_rotating" "rotation_period" {
      + day              = (known after apply)
      + hour             = (known after apply)
      + id               = (known after apply)
      + minute           = (known after apply)
      + month            = (known after apply)
      + rfc3339          = (known after apply)
      + rotation_days    = 90
      + rotation_rfc3339 = (known after apply)
      + second           = (known after apply)
      + unix             = (known after apply)
      + year             = (known after apply)
    }

Plan: 48 to add, 1 to change, 0 to destroy.
```

</details>





<!-- github-comment: {"Command":"plan","PRNumber":108,"Program":"tfcmt","SHA1":"","Target":"prod_enterprise","Vars":{}} -->